import json

#  'cd' means cardtreasury
cd_refer = ['number', 'text', 'act', 'used', 'money']

cd1 = [1, 'Вас арестовали, отправляйтесь в тюрьму', 'jail', False, 0]
cd2 = [2, 'Освобождение из тюрьмы. Карта может быть использована позже или продана', 'ticket', False, 0]
cd3 = [3, 'Вернитесь на Старую дорогу', 'move', False, 0]
cd4 = [4, 'Банковская ошибка в вашу пользу, получите 200$', '+', False, 200]
cd5 = [5, 'Сбор ренты, получите 100$', '+', False, 100]
cd6 = [6, 'Вы получили наследство, получите 100$', '+', False, 100]
cd7 = [7, 'Выгодная продажа облигаций, получите 50$', '+', False, 50]
cd8 = [8, 'Возмещение налога, получите 25$', '+', False, 25]
cd9 = [9, 'Выгодная продажа акций, получите 25$', '+', False, 25]
cd10 = [10, 'Выгодная продажа акций, получите 25$', '+', False, 25]
cd11 = [11, 'Вы заняли второе место на конкурсе красотыБ получите 10$', '+', False, 10]
cd12 = [12, 'Оплата лечения, заплатите 100$', '-', False, 100]
cd13 = [13, 'Оплата услуг доктора, заплатите 50$', '-', False, 50]
cd14 = [14, 'Оплата страховки, заплатите 50$', '-', False, 50]

cards_treasury = [cd_refer, cd1, cd2, cd3, cd4, cd5, cd6, cd7, cd8, cd9, cd10, cd11, cd12, cd13, cd14]

with open('../settings/treasury.txt', 'w') as filehander:
    json.dump(cards_treasury, filehander)

